[
{
    "applicable_for": "High School Seniors, College & Graduate Students",
    "application_deadline": "15/12/2023",
    "description": [
        "If you’re a current or former active duty military member, or their dependent, pursuing a major in logistics or a comparable field, you may be interested in participating in the Allied.com Military Scholarship Competition. This annual scholarship awards $1,000 to two deserving applicants who submit a 400-800 word essay detailing their reasons for pursuing a logistics or supply chain management career…"
    ],
    "link": "https://scholarshipbasket.com/scholarships/allied-com-military-scholarship-competition/",
    "max_award_amount": "$1,000",
    "title": "Allied.com Military Scholarship Competition"
},
{
    "applicable_for": "College Underclassmen",
    "application_deadline": "31/12/2023",
    "description": [
        "If you are a college student interested in serving in the U.S. Air Force, consider applying for the U.S. Air Force In-College Scholarship Program (ISCP). To be eligible for this program, you must be a freshman or sophomore in the specific major at a university with an Air Force ROTC program and have completed at least one full-time term…"
    ],
    "link": "https://scholarshipbasket.com/scholarships/u-s-air-force-in-college-scholarship-program-icsp/",
    "max_award_amount": "$18,000",
    "title": "U.S. Air Force In-College Scholarship Program (ICSP)"
},
{
    "applicable_for": "Undergraduate Students ",
    "application_deadline": "31/12/2023",
    "description": [
        "The Civil Air Patrol (CAP) Cadet Flight Scholarships are scholarships awarded to CAP cadets who are interested in pursuing flight training. The CAP is a civilian auxiliary of the United States Air Force and has a cadet program for young adults ages 12-20. ",
        "The cadet flight scholarships are intended to help cadets achieve their aviation goals and support their development as future aerospace leaders…"
    ],
    "link": "https://scholarshipbasket.com/scholarships/cap-cadet-flight-scholarships/",
    "max_award_amount": "$20,000",
    "title": "CAP Cadet Flight Scholarships"
},
{
    "applicable_for": "Undergraduate Students ",
    "application_deadline": "31/12/2023",
    "description": [
        "The Civil Air Patrol (CAP) William E. Hanna Scholarship is a scholarship program that supports CAP cadets who are pursuing a career in aviation or a related field. The scholarship is named after William E. Hanna, who was a former CAP national commander and strong supporter of the organization’s cadet program. ",
        "The scholarship is competitive and is awarded based on the applicant’s academic achievement…"
    ],
    "link": "https://scholarshipbasket.com/scholarships/civil-air-patrol-william-e-hanna-scholarship/",
    "max_award_amount": "$5,000",
    "title": "Civil Air Patrol William E. Hanna Scholarship"
},
{
    "applicable_for": "Graduated Students",
    "application_deadline": "31/12/2023",
    "description": [
        "The NBCC Foundation Military Scholarship is a scholarship program offered by the National Board for Certified Counselors (NBCC) Foundation. It is designed to support military service members and veterans who are pursuing a career in counseling. ",
        "The scholarship provides financial assistance to cover the costs associated with earning a master’s degree in counseling from an accredited institution…"
    ],
    "link": "https://scholarshipbasket.com/scholarships/nbcc-foundation-military-scholarship/",
    "max_award_amount": "$8,000",
    "title": "NBCC Foundation Military Scholarship"
},
{
    "applicable_for": "High School Senior",
    "application_deadline": "31/12/2023",
    "description": [
        "The Air Force ROTC High School Scholarship is a program designed to provide financial assistance to high school seniors who are interested in pursuing a college education and a career as an officer in the US Air Force. The scholarship covers tuition, fees, textbooks, and a monthly stipend for living expenses…"
    ],
    "link": "https://scholarshipbasket.com/scholarships/air-force-rotc-high-school-scholarship/",
    "max_award_amount": "$10,000",
    "title": "Air Force ROTC High School Scholarship"
},
{
    "applicable_for": "High School Students ",
    "application_deadline": "31/12/2023",
    "description": [
        "The NRA Civil Rights Defense Fund Youth Essay Contest is an annual essay competition for students in grades K-12. The contest is sponsored by the National Rifle Association (NRA) Civil Rights Defense Fund, a nonprofit organization dedicated to protecting and defending the Second Amendment rights of American citizens. ",
        "The purpose of the contest is to encourage young people to become more familiar with the U.S. Constitution…"
    ],
    "link": "https://scholarshipbasket.com/scholarships/nra-civil-rights-defense-fund-youth-essay-contest/",
    "max_award_amount": "$1,000",
    "title": "NRA Civil Rights Defense Fund Youth Essay Contest"
},
{
    "applicable_for": "High School Students Or Undergraduate Students",
    "application_deadline": "03/01/2024",
    "description": [
        "Only Michigan residents who are high school seniors or college students – without a bachelor’s degree – who are sons, daughters, grandchildren, or great-grandchildren of wartime veterans are eligible for the William D and Jewell W Brewer Scholarship Trusts. Applicants must be planning to attend or already be enrolled in a nationally accredited college…"
    ],
    "link": "https://scholarshipbasket.com/scholarships/william-d-and-jewell-w-brewer-scholarship/",
    "max_award_amount": "$500",
    "title": "William D and Jewell W Brewer Scholarship"
}
]